# -----------------------------------------------------------------------------------
# Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят,
# и сколько между ними находится букв.
# -----------------------------------------------------------------------------------

first = input('Введите первую букву латинского алфавита: ')
second = input('Введите вторую отличную от первой букву латинского алфавита: ')

result = abs(ord(first) - ord(second)) - 1
first = ord(first) - ord('a') + 1
second = ord(second) - ord('a') + 1

print(f'Код символа "{chr(first + ord("a"))}": {first}')
print(f'Код символа "{chr(second + ord("a"))}": {second}')
print(f'Между "{chr(first + ord("a") - 1)}" и "{chr(second + ord("a") - 1)}" еще {result} букв')
